remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam/applications/sam4e_ek_demo/sam4e16e_sam4e_ek/iar/asf.h
/**
 * \file
 *
 * \brief Autogenerated API include file for the Atmel Software Framework (ASF)
 *
 * Copyright (c) 2012 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef ASF_H
#define ASF_H

/*
 * This file includes all API header files for the selected drivers from ASF.
 * Note: There might be duplicate includes required by more than one driver.
 *
 * The file is automatically generated and will be re-written when
 * running the ASF driver selector tool. Any changes will be discarded.
 */

// From module: AFEC - Analog-Front-End Controller
#include <afec.h>

// From module: Common SAM compiler driver
#include <compiler.h>
#include <status_codes.h>

// From module: DACC - Digital-to-Analog Converter
#include <dacc.h>

// From module: Delay routines
#include <delay.h>

// From module: Display - AAT31XX Backlight Controller
#include <aat31xx.h>

// From module: Display - ADS7843 Touch Controller
#include <ads7843.h>

// From module: Display - Generic Resistive Touch Service
#include <rtouch.h>
#include <rtouch_ads7843.h>

// From module: Display - ILI93xx LCD Controller
#include <ili9325_regs.h>
#include <ili9341_regs.h>
#include <ili93xx.h>

// From module: Ethernet Physical Transceiver (ksz8051mnl)
#include <ethernet_phy.h>

// From module: FreeRTOS mini Real-Time Kernel
#include <FreeRTOS.h>
#include <FreeRTOS_CLI.h>
#include <StackMacros.h>
#include <croutine.h>
#include <list.h>
#include <mpu_wrappers.h>
#include <portable.h>
#include <projdefs.h>
#include <queue.h>
#include <semphr.h>
#include <task.h>
#include <timers.h>

// From module: GPIO - General purpose Input/Output
#include <gpio.h>

// From module: Generic board support
#include <board.h>

// From module: IOPORT - General purpose I/O service
#include <ioport.h>

// From module: IPv4 support in lwIP v141
#include <lwip/autoip.h>
#include <lwip/icmp.h>
#include <lwip/igmp.h>
#include <lwip/inet.h>
#include <lwip/inet_chksum.h>
#include <lwip/ip.h>
#include <lwip/ip_addr.h>
#include <lwip/ip_frag.h>

// From module: Interrupt management - SAM implementation
#include <interrupt.h>

// From module: PDC - Peripheral DMA Controller Example
#include <pdc.h>

// From module: PHY Ethernet MAC (GMAC)
#include <gmac.h>

// From module: PIO - Parallel Input/Output Controller
#include <pio.h>

// From module: PMC - Power Management Controller
#include <pmc.h>
#include <sleep.h>

// From module: Part identification macros
#include <parts.h>

// From module: QTouch Sensor with I2C interface
#include <QT2160.h>
#include <qt_i2c.h>

// From module: RSTC - Reset Controller
#include <rstc.h>

// From module: SAM FPU driver
#include <fpu.h>

// From module: SAM4E EK LED support enabled
#include <led.h>

// From module: SAM4E startup code
#include <exceptions.h>

// From module: SMC - Static Memory Controller
#include <smc.h>

// From module: SPI - SAM Implementation
#include <spi_master.h>
#include <spi_master.h>

// From module: SPI - Serial Peripheral Interface
#include <spi.h>

// From module: Sleep manager - SAM implementation
#include <sam/sleepmgr.h>
#include <sleepmgr.h>

// From module: Stand-alone port(no OS) of the lwIP v141 stack on SAM hardware module.
#include <arch/cc.h>
#include <arch/perf.h>
#include <sam4e_gmac.h>

// From module: Standard serial I/O (stdio) - SAM implementation
#include <stdio_serial.h>

// From module: System Clock Control - SAM4E implementation
#include <sysclk.h>

// From module: TC - Timer Counter
#include <tc.h>

// From module: TWI - Two-Wire Interface - SAM implementation
#include <sam_twi/twi_master.h>
#include <sam_twi/twi_slave.h>
#include <twi_master.h>
#include <twi_slave.h>

// From module: TWI - Two-wire Interface
#include <twi.h>

// From module: UART - Univ. Async Rec/Trans
#include <uart.h>

// From module: USART - Serial interface - SAM implementation for devices with both UART and USART
#include <serial.h>

// From module: USART - Univ. Syn Async Rec/Trans
#include <usart.h>

// From module: lwIP TCP/IP Stack v141
#include <sio.h>
#include <tcpip.h>

// From module: pio_handler support enabled
#include <pio_handler.h>

#endif // ASF_H
